Revit 2018 API
OverrideGraphicSettings.SetCutFillPatternVisible Method
 Sets the visibility of the cut surface fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2014
Syntax
C#
public OverrideGraphicSettings SetCutFillPatternVisible(
	bool cutFillPatternVisible
)
Visual Basic
Public Function SetCutFillPatternVisible ( _
	cutFillPatternVisible As Boolean _
) As OverrideGraphicSettings
Visual C++
public:
OverrideGraphicSettings^ SetCutFillPatternVisible(
	bool cutFillPatternVisible
)
Parameters
cutFillPatternVisible
Type: System.Boolean
 Value of the visibility of the cut surface fill pattern.
Return Value
 Reference to the changed object.
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace